# -*- coding: utf-8 -*-
# fox.py (c) Mikhail Mezyakov <mihail265@gmail.com>
# Released under the GNU GPL v.3
# 
# Fox Jovovich emulator

import random

def horo(channel, user, args):
    """Generate sentence in Fox Jovovich style"""
    
    fox = (
        "десятилетку", "самоубийством", "имеющая", "докипеть", 
        "склочником", "гермошлеме", "огурчиками", "разбирающаяся", 
        "тускнела", "придурковатым", "обирая", "полуобнаженному", 
        "хрипя", "прадедовских", "позлащен", "домработницах", 
        "милостыню", "очумевшей", "приструнили", "подружатся",
        "одолевшую", "прожужжать", "отрубаю", "захарканную", 
        "дошиваемый", "навязанные", "провонявшим", "обрубках", 
        "популярнейшим", "замызгано", "обозначаемый", "резачок", 
        "подсобников", "обуглилась", "околдовавшая", "нейросеть", 
        "насуслить", "перебилы", "отросшую", "сплетница", "фотич", 
        "красившемуся", "хасидизм", "свежеиспеченным", "вдуешь", 
        "выраженные", "отрезается", "сухинина", "многоразличными",
        "сижу", "тромбонах", "хряща", "подсознания", "тюленей", 
        "секретнейшей", "разочаровываешь", "абонированную", 
        "подписанию", "непрочные", "сделанному", "энциклопедист", 
        "небесна", "втридешева", "спросах", "вотум", "горестных", 
        "распоровшийся", "оцепенелых", "очковтирательский", "дедах", 
        "инклюзив", "морозная", "поджелудочными", "варьировался", 
        "возвышающееся", "яичковый", "упрекавшую", "благости", 
        "Здравствуй,", "нескромный", "воин"
    )

    result = []
    for i in range(2):
        result.append(fox[random.randint(0, len(fox) - 1)])

    return u'PRIVMSG {channel} :{result}'.format(
        channel = channel,
        result = ' '.join(result)
    )
